sulaolab/dspic33ak-audio-dsp-sonora/src/app/apps/classic/dsp/biquad_cascade_4ch.c
#include "app_specific_config_defs.h"
#include "app_runtime_overrides.h"
#include <xc.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <string.h>
#include <math.h>
#include "nora_dma.h"
#include "nora_high_res_timer.h"
#include "gain_ctrl.h"
#include "arm_math.h"


#include "biquad_cascade_4ch.h"


#if defined(ENA_BIQUAD_IIR_CASCADE)
//===========================================================
// Definition
//===========================================================

// This module applies a fixed-coefficient biquad cascade to 4ch float audio.
//
// Buffer layout:
//   4ch sample-major interleaved
//   L1, R1, L2, R2, L1, R1, L2, R2, ...
//
// Biquad form:
//   Direct Form II Transposed
//
//   y  = b0 * x + z1
//   z1 = b1 * x - a1 * y + z2
//   z2 = b2 * x - a2 * y
//
// Coefficient rule:
//   a0 is assumed to be 1.0 and is not stored in the table.
//   Coefficients must already be normalized by a0.
//
// Bypass coefficient:
//   { 1.0f, 0.0f, 0.0f, 0.0f, 0.0f }


// #define ENA_SELFTEST


//===========================================================
// Enum & Struct typedef
//===========================================================

typedef enum
{
    APP_BIQUAD_CASCADE_4CH_PROC_NORMAL_ACTIVE = 0,
    APP_BIQUAD_CASCADE_4CH_PROC_BYPASS_REQUESTED,
    APP_BIQUAD_CASCADE_4CH_PROC_BYPASS_ACTIVE,
} app_biquad_cascade_4ch_proc_state_t;


//===========================================================
// Function Prototype
//===========================================================

static const char* biquad_cascade_4ch_csv_skip_delim(const char* p);
static int         biquad_cascade_4ch_csv_count_values(const char* text, int* parse_error_index);
static void        biquad_cascade_4ch_csv_update_summary(void);
static void        biquad_cascade_4ch_csv_print_summary(void);
static bool        biquad_cascade_4ch_csv_load_coeff_from_text(void);
static void        biquad_cascade_4ch_cmsis_prepare_coeff(void);
static void        biquad_cascade_4ch_process_bypass(const float* in, float* out, int samples);

static void        app_biquad_cascade_4ch_process_wrapper(const float* in, float* out, int samples);






//===========================================================
// Variables
//===========================================================

// Coefficient table format:
//   [stage][ch]
//   { b0, b1, b2, a1, a2 }
//
// CSV source image per stage:
//
//           ch1,     ch2,     ch3,     ch4
//   b0      ...,     ...,     ...,     ...
//   b1      ...,     ...,     ...,     ...
//   b2      ...,     ...,     ...,     ...
//   a1      ...,     ...,     ...,     ...
//   a2      ...,     ...,     ...,     ...
//
// Manual conversion rule:
//   ch1 -> { b0_ch1, b1_ch1, b2_ch1, a1_ch1, a2_ch1 }
//   ch2 -> { b0_ch2, b1_ch2, b2_ch2, a1_ch2, a2_ch2 }
//   ch3 -> { b0_ch3, b1_ch3, b2_ch3, a1_ch3, a2_ch3 }
//   ch4 -> { b0_ch4, b1_ch4, b2_ch4, a1_ch4, a2_ch4 }

static const biquad_t biquad_bypass_1ch    = { 1.0f, 0.0f, 0.0f, 0.0f, 0.0f };
static const biquad_t biquad_1khz_3dB_1ch  = { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f };
static const biquad_t biquad_1khz_m3dB_1ch = { 0.97112681f, -1.78656936f, 0.83114562f, -1.78656936f,  0.80227183f };

static biquad_t g_biquad_cascade_4ch_coeff[BIQUAD_CASCADE_4CH_NUM_STAGE][BIQUAD_CASCADE_NUM_CH];




// CSV paste area for coefficient import.
//
// Operation image:
//   1. Open coefficient CSV with a text editor.
//   2. Select all / copy.
//   3. Replace the lines between "paste CSV below" and "paste CSV above".
//
// Expected numeric order:
//   One line = one coefficient kind of one stage.
//   Columns  = ch1,ch2,ch3,ch4
//   Rows     = Stage00 b0,b1,b2,a1,a2, Stage01 b0,b1,b2,a1,a2, ...
//   Header   = none
//
// The data is stringized first, so normal CSV lines do not need a trailing comma.
#define BIQUAD_CSV_TEXT(...)  #__VA_ARGS__


static const char g_biquad_cascade_4ch_csv_text[] = BIQUAD_CSV_TEXT(
/* paste CSV below */
//
// No need to format the CSV text neatly.
//
/////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////



// ch1           ch2           ch3           ch4          stage
 0.992871106 ,  0.992967129 ,   0.97711885 ,  0.977378011  // 0    b0
 -1.97894061 ,  -1.97968435 ,   -1.9486047 ,  -1.94946957  // 0    b1
 0.986273527 ,  0.986917198 ,  0.971766591 ,  0.972350836  // 0    b2
 -1.97894061 ,  -1.97968435 ,   -1.9486047 ,  -1.94946957  // 0    a1
 0.979144573 ,  0.979884386 ,  0.948885441 ,  0.949728906  // 0    a2
 0.814266562 ,  0.820286274 ,  0.904021382 ,  0.907745063  // 1    b0
 -1.52954948 ,  -1.54891443 ,  -1.67325652 ,  -1.67420924  // 1    b1
 0.750898242 ,  0.760599136 ,  0.803852916 ,  0.802503824  // 1    b2
 -1.52954948 ,  -1.54891443 ,  -1.67325652 ,  -1.67420924  // 1    a1
 0.565164804 ,   0.58088541 ,  0.707874298 ,  0.710249007  // 1    a2
 0.702026665 ,  0.749260366 ,   1.00707543 ,   1.00657451  // 2    b0
-0.056509871 , -0.158265755 ,  -1.97302425 ,  -1.97315097  // 2    b1
 0.382087648 ,  0.384988844 ,  0.973001361 ,  0.973490119  // 2    b2
-0.056509871 , -0.158265755 ,  -1.97302425 ,  -1.97315097  // 2    a1
 0.084114283 ,   0.13424924 ,  0.980076849 ,   0.98006469  // 2    a2
 0.988732278 ,  0.990001917 ,   1.18418324 ,    1.0906955  // 3    b0
 -1.96993399 ,  -1.97245312 , -0.034989715 , -0.302464098  // 3    b1
 0.982993603 ,  0.984245062 ,  0.445696861 ,  0.727050245  // 3    b2
 -1.96993399 ,  -1.97245312 , -0.034989715 , -0.302464098  // 3    a1
 0.971725881 ,  0.974246919 ,  0.629880071 ,  0.817745686  // 3    a2
  1.02711582 ,    1.0290935 ,   1.00042057 ,   1.00040221  // 4    b0
 -1.89464402 ,  -1.89373195 ,  -1.99831581 ,  -1.99839771  // 4    b1
 0.918394566 ,  0.912442684 ,  0.997974694 ,  0.998083472  // 4    b2
 -1.89464402 ,  -1.89373195 ,  -1.99831581 ,  -1.99839771  // 4    a1
 0.945510328 ,  0.941536129 ,  0.998395383 ,  0.998485625  // 4    a2
  1.00141835 ,   1.00186658 ,   0.99872756 ,  0.996901274  // 5    b0
  -1.9967463 ,  -1.97909403 ,   -1.9946059 ,  -1.98451424  // 5    b1
 0.995731294 ,  0.981357098 ,   0.99591893 ,  0.989346862  // 5    b2
  -1.9967463 ,  -1.97909403 ,   -1.9946059 ,  -1.98451424  // 5    a1
 0.997149706 ,  0.983223677 ,   0.99464643 ,  0.986248136  // 5    a2
 0.998435199 ,   1.00128722 ,  0.997150779 ,   1.00019431  // 6    b0
 -1.99298763 ,  -1.99641621 ,   -1.9849472 ,  -1.99919212  // 6    b1
 0.995094597 ,  0.995540679 ,  0.989638627 ,   0.99901861  // 6    b2
 -1.99298763 ,  -1.99641621 ,   -1.9849472 ,  -1.99919212  // 6    a1
 0.993529737 ,  0.996827841 ,  0.986789405 ,  0.999212861  // 6    a2
  1.01084602 ,  0.998640656 ,   1.10284495 ,   0.99976474  // 7    b0
 -1.91917479 ,  -1.99318647 ,  -1.07471144 ,  -1.99840128  // 7    b1
 0.915613294 ,  0.995056689 ,  0.643720567 ,  0.998678863  // 7    b2
 -1.91917479 ,  -1.99318647 ,  -1.07471144 ,  -1.99840128  // 7    a1
 0.926459312 ,  0.993697286 ,  0.746565461 ,  0.998443663  // 7    a2
  0.99976033 ,  0.999783278 ,   1.00015473 ,  0.999367416  // 8    b0
 -1.99844599 ,  -1.99859381 ,  -1.99910915 ,  -1.99395943  // 8    b1
 0.998694718 ,   0.99881959 ,  0.998975039 ,  0.995167553  // 8    b2
 -1.99844599 ,  -1.99859381 ,  -1.99910915 ,  -1.99395943  // 8    a1
 0.998455107 ,  0.998602867 ,  0.999129951 ,  0.994534969  // 8    a2
   0.9167943 ,  0.982661664 ,  0.943612158 ,   1.01713336  // 9    b0
  1.09599614 ,  -1.36437154 , -0.828307927 ,  -1.53878915  // 9    b1
 0.646293938 ,  0.873029828 ,  0.794944823 ,   0.88661015  // 9    b2
  1.09599614 ,  -1.36437154 , -0.828307927 ,  -1.53878915  // 9    a1
 0.563088298 ,  0.855691552 ,  0.738556981 ,  0.903743565  // 9    a2
   1.1856432 ,   0.89669317 ,  0.975446641 ,   1.00692523  // 10   b0
 0.683565259 ,   1.07148886 ,  -1.35408735 ,  -1.90868771  // 10   b1
 0.441302836 ,  0.631443322 ,  0.866257429 ,  0.954168558  // 10   b2
 0.683565259 ,   1.07148886 ,  -1.35408735 ,  -1.90868771  // 10   a1
 0.626946092 ,  0.528136492 ,  0.841704071 ,  0.961093783  // 10   a2
 0.994721711 ,   1.13805616 ,  0.999133289 ,   1.02369082  // 11   b0
 -1.95903838 ,  0.878511488 ,  -1.99368989 ,  -1.14875937  // 11   b1
 0.977030337 ,  0.584516823 ,  0.995131969 ,  0.843213379  // 11   b2
 -1.95903838 ,  0.878511488 ,  -1.99368989 ,  -1.14875937  // 11   a1
 0.971752048 ,  0.722573102 ,  0.994265378 ,   0.86690414  // 11   a2
  0.99626714 ,   0.99626714 ,   1.00883591 ,    1.0914489  // 12   b0
 -1.99253428 ,  -1.99253428 ,  -1.91044867 ,  0.267743289  // 12   b1
  0.99626714 ,   0.99626714 ,   0.95406729 ,  0.624927104  // 12   b2
 -1.99252069 ,  -1.99252069 ,  -1.91044867 ,  0.267743289  // 12   a1
 0.992547989 ,  0.992547989 ,  0.962903082 ,  0.716376066  // 12   a2
 0.687483072 ,  0.687483072 ,   0.99626714 ,   0.99626714  // 13   b0
  1.37496614 ,   1.37496614 ,  -1.99253428 ,  -1.99253428  // 13   b1
 0.687483072 ,  0.687483072 ,   0.99626714 ,   0.99626714  // 13   b2
  1.27624798 ,   1.27624798 ,  -1.99252069 ,  -1.99252069  // 13   a1
 0.473684162 ,  0.473684162 ,  0.992547989 ,  0.992547989  // 13   a2
           1 ,            1 ,  0.687483072 ,  0.687483072  // 14   b0
           0 ,            0 ,   1.37496614 ,   1.37496614  // 14   b1
           0 ,            0 ,  0.687483072 ,  0.687483072  // 14   b2
           0 ,            0 ,   1.27624798 ,   1.27624798  // 14   a1
           0 ,            0 ,  0.473684162 ,  0.473684162  // 14   a2


