sulaolab/dspic33ak-audio-dsp-sonora/src/app/apps/classic/dsp/biquad_cascade_4ch.c
/////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////
/* paste CSV above */
);


volatile int g_biquad_cascade_4ch_csv_load_result      = 0;
volatile int g_biquad_cascade_4ch_csv_load_error_index = -1;
volatile int g_biquad_cascade_4ch_csv_total_values     = 0;
volatile int g_biquad_cascade_4ch_csv_expected_values  = 0;
volatile int g_biquad_cascade_4ch_csv_stage_count      = 0;
volatile int g_biquad_cascade_4ch_csv_remainder_values = 0;

#if 0
// dspic33-cmsis-dsp / MCHP DF2T test path.
// The library API is 1ch block processing, so this wrapper deinterleaves
// 4ch interleaved audio into temporary per-channel buffers.
static arm_biquad_cascade_df2T_instance_f32 g_biquad_cascade_4ch_cmsis_inst[BIQUAD_CASCADE_NUM_CH] __attribute__((aligned(4)));
static float32_t g_biquad_cascade_4ch_cmsis_coeff[BIQUAD_CASCADE_NUM_CH][5u * BIQUAD_CASCADE_4CH_NUM_STAGE] __attribute__((aligned(4)));
static float32_t g_biquad_cascade_4ch_cmsis_state[BIQUAD_CASCADE_NUM_CH][2u * BIQUAD_CASCADE_4CH_NUM_STAGE] __attribute__((aligned(4)));
// static float32_t g_biquad_cascade_4ch_cmsis_ch_in [BIQUAD_CASCADE_NUM_CH][APP_BLOCK_FRAMES] __attribute__((aligned(4)));
// static float32_t g_biquad_cascade_4ch_cmsis_ch_out[BIQUAD_CASCADE_NUM_CH][APP_BLOCK_FRAMES] __attribute__((aligned(4)));
#else
#define BIQUAD_XMEM     __attribute__((section(".xbss"),    aligned(4)))
#define BIQUAD_YMEM     __attribute__((section(".ybss"),    aligned(4)))
#define BIQUAD_CONST_X  __attribute__((section(".const,x"), aligned(4)))

// dspic33-cmsis-dsp / MCHP DF2T test path.
// The library API is 1ch block processing, so this wrapper deinterleaves
// 4ch interleaved audio into temporary per-channel buffers.
static arm_biquad_cascade_df2T_instance_f32 g_biquad_cascade_4ch_cmsis_inst[BIQUAD_CASCADE_NUM_CH] __attribute__((aligned(4)));
static float32_t g_biquad_cascade_4ch_cmsis_coeff[BIQUAD_CASCADE_NUM_CH][5u * BIQUAD_CASCADE_4CH_NUM_STAGE] BIQUAD_XMEM;
static float32_t g_biquad_cascade_4ch_cmsis_state[BIQUAD_CASCADE_NUM_CH][2u * BIQUAD_CASCADE_4CH_NUM_STAGE] BIQUAD_YMEM;
// static float32_t g_biquad_cascade_4ch_cmsis_ch_in [BIQUAD_CASCADE_NUM_CH][APP_BLOCK_FRAMES] BIQUAD_XMEM;
// static float32_t g_biquad_cascade_4ch_cmsis_ch_out[BIQUAD_CASCADE_NUM_CH][APP_BLOCK_FRAMES] BIQUAD_YMEM;
#endif//01




volatile float g_biquad_cascade_4ch_cmsis_test_max_abs_diff = 0.0f;

uint32_t t0, dt;




typedef void (*biquad_cascade_proc_func_t)(const float* in, float* out, int samples);
static void dummy_proc(const float* in, float* out, int samples)
{
    (void)in;
    (void)out;
    (void)samples;
}


/*
 * Note: volatile is not mutual exclusion.
 * Updates must be protected by the DMA0 critical section.
 */
static volatile biquad_cascade_proc_func_t s_biquad_proc = dummy_proc;


static inline bool biquad_cascade_4ch_enter_dma0_critical(void)
{
    bool dma0ie_save;

    dma0ie_save = nora_dma_irq_disable_save(0u);
    return dma0ie_save;
}
static inline void biquad_cascade_4ch_exit_dma0_critical(bool dma0ie_save)
{
    nora_dma_irq_restore(0u, dma0ie_save);
}


static void biquad_cascade_4ch_set_proc_active_critical(void)
{
    bool dma0ie_save = biquad_cascade_4ch_enter_dma0_critical();

#if defined(USE_CMSIS_IIR_DSP_PROCESS)
    /*
     * Directly select the real active processing function.
     * Do not route through an additional active wrapper; this keeps the
     * DMA0 ISR call chain as short as possible:
     *   app_biquad...process() -> s_biquad_proc -> CMSIS/C implementation
     */
    s_biquad_proc = biquad_cascade_4ch_process_cmsis;
#else
    s_biquad_proc = app_biquad_cascade_4ch_process_wrapper;
#endif //defined(USE_CMSIS_IIR_DSP_PROCESS)

    biquad_cascade_4ch_exit_dma0_critical(dma0ie_save);
}


static void biquad_cascade_4ch_set_proc_bypass_critical(void)
{
    bool dma0ie_save = biquad_cascade_4ch_enter_dma0_critical();

    s_biquad_proc = biquad_cascade_4ch_process_bypass;

    biquad_cascade_4ch_exit_dma0_critical(dma0ie_save);
}






//===========================================================
// Global Function
//===========================================================

/**
 * @brief Initialize a 4ch biquad cascade instance.
 *
 * Behavior:
 *   - Clears all delay states.
 *   - Clears NaN/Inf debug counters.
 *
 * @param pbq Pointer to @c biquad_cascade_4ch_t instance.
 */
void biquad_cascade_4ch_init( biquad_cascade_4ch_t* pbq )
{
    if (pbq == NULL)
    {
        return;
    }

    memset( pbq, 0x00, sizeof(biquad_cascade_4ch_t) );

    pbq->last_nan_inf_stage = -1;
    pbq->last_nan_inf_ch    = -1;



    // If CSV parsing fails, unfilled coefficients remain safe bypass values.
    for(uint16_t stage=0; stage<BIQUAD_CASCADE_4CH_NUM_STAGE; stage++ )
    {
        for(uint8_t ch=0; ch<BIQUAD_CASCADE_NUM_CH; ch++ )
        {
            g_biquad_cascade_4ch_coeff[stage][ch] = biquad_bypass_1ch;
            (void)biquad_1khz_3dB_1ch;
            (void)biquad_1khz_m3dB_1ch;
        }
    }


#define ENA_BIQUAD_LOAD_TEST_COEFF

#if defined(ENA_BIQUAD_LOAD_TEST_COEFF)
    // load test
    for(uint16_t stage=0; stage<BIQUAD_CASCADE_4CH_NUM_STAGE; stage++ )
    {
        for(uint8_t ch=0; ch<BIQUAD_CASCADE_NUM_CH; ch++ )
        {
            if( stage%2 )
            {
                g_biquad_cascade_4ch_coeff[stage][ch] = biquad_1khz_m3dB_1ch;
            }
            else
            {
                g_biquad_cascade_4ch_coeff[stage][ch] = biquad_1khz_3dB_1ch;
            }
            (void)biquad_bypass_1ch;
        }
    }
#else
    biquad_cascade_4ch_csv_load_coeff_from_text();
#endif //defined(ENA_BIQUAD_LOAD_TEST_COEFF)

    app_biquad_cascade_4ch_debug_print_coeff(0, 2);
}


void biquad_cascade_4ch_reset( biquad_cascade_4ch_t* pbq )
{
    if (pbq == NULL)
    {
        return;
    }

    memset( pbq->st, 0x00, sizeof(pbq->st) );

    pbq->nan_inf_count     = 0u;
    pbq->last_nan_inf_stage = -1;
    pbq->last_nan_inf_ch    = -1;
}


/**
 * @brief Convert local [stage][ch] coefficient table to MCHP/CMSIS DF2T layout.
 *
 * Local coefficient rule:
 *   y  = b0*x + z1
 *   z1 = b1*x - a1*y + z2
 *   z2 = b2*x - a2*y
 *
 * CMSIS DF2T implementations commonly use +a1/+a2 in the state update.
 * CMSIS_NEGATE_A_COEFF selects whether a1/a2 are negated
 * during conversion. Use the self-test to confirm the correct convention.
 */
static void biquad_cascade_4ch_cmsis_prepare_coeff(void)
{
    for (int ch = 0; ch < BIQUAD_CASCADE_NUM_CH; ch++)
    {
        for (int stage = 0; stage < BIQUAD_CASCADE_4CH_NUM_STAGE; stage++)
        {
            const biquad_t* bq = &g_biquad_cascade_4ch_coeff[stage][ch];
            float32_t*      pc = &g_biquad_cascade_4ch_cmsis_coeff[ch][stage * 5];

            pc[0] = (float32_t)bq->b0;
            pc[1] = (float32_t)bq->b1;
            pc[2] = (float32_t)bq->b2;
#if CMSIS_NEGATE_A_COEFF
            pc[3] = (float32_t)(-bq->a1);
            pc[4] = (float32_t)(-bq->a2);
#else
            pc[3] = (float32_t)bq->a1;
            pc[4] = (float32_t)bq->a2;
#endif
        }
    }
}


/**
 * @brief Initialize dspic33-cmsis-dsp / MCHP DF2T test instances.
 */
void biquad_cascade_4ch_cmsis_init(void)
{
    biquad_cascade_4ch_cmsis_prepare_coeff();

    memset(g_biquad_cascade_4ch_cmsis_state, 0x00, sizeof(g_biquad_cascade_4ch_cmsis_state));

