sulaolab/dspic33ak-audio-dsp-sonora/src/app/apps/classic/dsp/biquad_cascade_4ch.c
    for (int ch = 0; ch < BIQUAD_CASCADE_NUM_CH; ch++)
    {
        arm_biquad_cascade_df2T_init_f32(&g_biquad_cascade_4ch_cmsis_inst[ch],
                                         (uint8_t)BIQUAD_CASCADE_4CH_NUM_STAGE,
                                         g_biquad_cascade_4ch_cmsis_coeff[ch],
                                         g_biquad_cascade_4ch_cmsis_state[ch]);
    }
}


/**
 * @brief Apply dspic33-cmsis-dsp / MCHP DF2T biquad cascade to 4ch audio.
 *
 * Input and output are 4ch channel-major buffers.
 *
 * Buffer layout:
 *   in[0 * samples + n] = L1
 *   in[1 * samples + n] = R1
 *   in[2 * samples + n] = L2
 *   in[3 * samples + n] = R2
 *
 * The CMSIS/MCHP API processes one contiguous channel block, so this layout
 * can be passed directly without the deinterleave/interleave temporary copies
 * used by @c biquad_cascade_4ch_process_cmsis().
 *
 * @param in  Channel-major 4ch input buffer [4][samples].
 * @param out Channel-major 4ch output buffer [4][samples].
 * @param samples Number of samples per channel.
 */
void biquad_cascade_4ch_process_cmsis( const float* in,
                                                 float* out,
                                                 int    samples )
{
    if ((in == NULL) || (out == NULL) || (samples <= 0) || (samples > APP_BLOCK_FRAMES))
    {
        return;
    }

    for (int ch = 0; ch < BIQUAD_CASCADE_NUM_CH; ch++)
    {
        const float32_t* p_src = &in [ch * samples];
              float32_t* p_dst = &out[ch * samples];

#if APP_TARGET == APP_TARGET_AK512
        t0 = nora_high_res_timer_get_count();
#endif //APP_TARGET == APP_TARGET_AK512

#if 0
        arm_biquad_cascade_df2T_f32(&g_biquad_cascade_4ch_cmsis_inst[ch],
                                     p_src,
                                     p_dst,
                                     (uint32_t)samples);
#else
        extern void biquad_cascade_df2T_f32_dspic33ak_opt_v1(const mchp_biquad_cascade_df2T_instance_f32 * S,
                                                             const float32_t * pSrc,
                                                             float32_t * pDst, uint32_t blockSize);
        biquad_cascade_df2T_f32_dspic33ak_opt_v1(
            &g_biquad_cascade_4ch_cmsis_inst[ch],
            p_src,
            p_dst,
            (uint32_t)samples
        );
#endif //01

#if APP_TARGET == APP_TARGET_AK512
        dt = nora_high_res_timer_elapsed_count(t0);
#endif //APP_TARGET == APP_TARGET_AK512
    }
}




/**
 * @brief Apply fixed biquad cascade to 4ch float audio, channel-major buffer version.
 *
 * Input and output are 4ch channel-major buffers.
 *
 * Buffer layout:
 *   in[0 * samples + n] = L1
 *   in[1 * samples + n] = R1
 *   in[2 * samples + n] = L2
 *   in[3 * samples + n] = R2
 *
 * This is the C reference / fallback path for the new channel-major audio
 * pipeline.  It keeps the same DF2T equation and coefficient/state tables as
 * @c biquad_cascade_4ch_process(), but does not need pointer stepping by 4
 * because each channel is already contiguous.
 *
 * In-place processing is allowed, i.e. @p in and @p out may point to
 * the same buffer.
 *
 * @param pbq     Pointer to @c biquad_cascade_4ch_t instance.
 * @param in  Channel-major 4ch input buffer [4][samples].
 * @param out Channel-major 4ch output buffer [4][samples].
 * @param samples Number of samples per channel.
 */
inline void biquad_cascade_4ch_process(       biquad_cascade_4ch_t* pbq,
                                           const float*                in,
                                                 float*                out,
                                                 int                   samples )
{
    if ((pbq == NULL) || (in == NULL) || (out == NULL) || (samples <= 0))
    {
        return;
    }

    // Channel-major buffer processing:
    //   channel -> sample -> stage
    // Each channel block is contiguous, which is friendlier to CMSIS/MCHP and
    // also removes the +4 interleaved pointer stride used by the old buffer.
    for (int ch = 0; ch < BIQUAD_CASCADE_NUM_CH; ch++)
    {
        const float* p_in  = &in [ch * samples];
              float* p_out = &out[ch * samples];

        for (int sample_idx = 0; sample_idx < samples; sample_idx++)
        {
            float x = *p_in++;

            for (int stage = 0; stage < BIQUAD_CASCADE_4CH_NUM_STAGE; stage++)
            {
                const biquad_t*      bq = &g_biquad_cascade_4ch_coeff[stage][ch];
                      biquad_stat_t* st = &pbq->st[stage][ch];

                float z1 = st->z1;
                float z2 = st->z2;

                // Direct Form II Transposed Biquad
                float y = bq->b0 * x + z1;
                z1 = bq->b1 * x - bq->a1 * y + z2;
                z2 = bq->b2 * x - bq->a2 * y;

#if BIQUAD_CASCADE_4CH_ENABLE_NAN_INF_PROTECT
                if ((!isfinite(y)) || (!isfinite(z1)) || (!isfinite(z2)))
                {
                    pbq->nan_inf_count++;
                    pbq->last_nan_inf_stage = stage;
                    pbq->last_nan_inf_ch    = ch;

                    y  = 0.0f;
                    z1 = 0.0f;
                    z2 = 0.0f;
                }
#endif

                st->z1 = z1;
                st->z2 = z2;

                x = y;
            }

            *p_out++ = x;
        }
    }
}


#if defined(ENA_SELFTEST)
/**
 * @brief Self-test comparing a fixed local DF2T reference and CMSIS/MCHP DF2T.
 *
 * This self-test is intentionally independent from normal run-time settings.
 * It does not use:
 *   - BIQUAD_CASCADE_4CH_NUM_STAGE
 *   - g_biquad_cascade_4ch_coeff[]
 *   - g_biquad_cascade_4ch_cmsis_inst/state[]
 *   - biquad_cascade_4ch_process_cmsis()
 *
 * Therefore changing the production stage count, CSV coefficients, or normal
 * audio processing state does not change the self-test condition.
 *
 * @return Maximum absolute difference over the fixed impulse test block.
 */
float biquad_cascade_4ch_cmsis_selftest(void)
{
#define SELFTEST_NUM_STAGE      (4)
#define SELFTEST_NUM_CH         (4)
#define SELFTEST_NUM_SAMPLE     (32)

    static const biquad_t selftest_coeff[SELFTEST_NUM_STAGE][SELFTEST_NUM_CH] =
    {
        {
            { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },
            { 0.97112681f, -1.78656936f, 0.83114562f, -1.78656936f, 0.80227183f },
            { 1.00000000f,  0.00000000f, 0.00000000f,  0.00000000f, 0.00000000f },
            { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f }
        },
        {
            { 0.97112681f, -1.78656936f, 0.83114562f, -1.78656936f, 0.80227183f },
            { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },
            { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },
            { 1.00000000f,  0.00000000f, 0.00000000f,  0.00000000f, 0.00000000f }
        },
        {
            { 1.00000000f,  0.00000000f, 0.00000000f,  0.00000000f, 0.00000000f },
            { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },
            { 0.97112681f, -1.78656936f, 0.83114562f, -1.78656936f, 0.80227183f },
            { 0.97112681f, -1.78656936f, 0.83114562f, -1.78656936f, 0.80227183f }
        },
        {
            { 0.97112681f, -1.78656936f, 0.83114562f, -1.78656936f, 0.80227183f },
            { 1.00000000f,  0.00000000f, 0.00000000f,  0.00000000f, 0.00000000f },
            { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },
            { 0.97112681f, -1.78656936f, 0.83114562f, -1.78656936f, 0.80227183f }
        }
    };

