sulaolab/dspic33ak-audio-dsp-sonora/src/app/apps/classic/dsp/biquad_cascade_4ch.c
    static float32_t in_interleaved [SELFTEST_NUM_SAMPLE * SELFTEST_NUM_CH] __attribute__((aligned(4)));
    static float32_t ref_interleaved[SELFTEST_NUM_SAMPLE * SELFTEST_NUM_CH] __attribute__((aligned(4)));
    static float32_t out_interleaved[SELFTEST_NUM_SAMPLE * SELFTEST_NUM_CH] __attribute__((aligned(4)));

    static float32_t coeff_cmsis[SELFTEST_NUM_CH][SELFTEST_NUM_STAGE * 5u] __attribute__((aligned(4)));
    static float32_t state_cmsis[SELFTEST_NUM_CH][SELFTEST_NUM_STAGE * 2u] __attribute__((aligned(4)));
    static float32_t ch_in      [SELFTEST_NUM_CH][SELFTEST_NUM_SAMPLE]      __attribute__((aligned(4)));
    static float32_t ch_out     [SELFTEST_NUM_CH][SELFTEST_NUM_SAMPLE]      __attribute__((aligned(4)));
    static biquad_stat_t ref_state[SELFTEST_NUM_STAGE][SELFTEST_NUM_CH];
    static arm_biquad_cascade_df2T_instance_f32 inst[SELFTEST_NUM_CH];

    float max_abs_diff = 0.0f;
    int max_idx = 0;

    memset(in_interleaved,  0x00, sizeof(in_interleaved));
    memset(ref_interleaved, 0x00, sizeof(ref_interleaved));
    memset(out_interleaved, 0x00, sizeof(out_interleaved));
    memset(coeff_cmsis,     0x00, sizeof(coeff_cmsis));
    memset(state_cmsis,     0x00, sizeof(state_cmsis));
    memset(ch_in,           0x00, sizeof(ch_in));
    memset(ch_out,          0x00, sizeof(ch_out));
    memset(ref_state,       0x00, sizeof(ref_state));

    // Fixed modest impulse test. This must not track production gain/stage settings.
    in_interleaved[0] = 0.03125f;
    in_interleaved[1] = 0.02500f;
    in_interleaved[2] = 0.01875f;
    in_interleaved[3] = 0.01250f;

    //
    // Reference path: local DF2T, fixed stage count, fixed coefficients.
    /////////////////
    for (int ch = 0; ch < SELFTEST_NUM_CH; ch++)
    {
        for (int sample_idx = 0; sample_idx < SELFTEST_NUM_SAMPLE; sample_idx++)
        {
            float x = in_interleaved[(sample_idx * SELFTEST_NUM_CH) + ch];

            for (int stage = 0; stage < SELFTEST_NUM_STAGE; stage++)
            {
                const biquad_t*    bq = &selftest_coeff[stage][ch];
                biquad_stat_t*     st = &ref_state[stage][ch];
                const float old_z1 = st->z1;
                const float old_z2 = st->z2;

                const float y  = (bq->b0 * x) + old_z1;
                const float z1 = (bq->b1 * x) - (bq->a1 * y) + old_z2;
                const float z2 = (bq->b2 * x) - (bq->a2 * y);

                st->z1 = z1;
                st->z2 = z2;
                x = y;
            }

            ref_interleaved[(sample_idx * SELFTEST_NUM_CH) + ch] = x;
        }
    }

    //
    // CMSIS/MCHP path: fixed local instance/state/coefficients.
    /////////////////
    for (int ch = 0; ch < SELFTEST_NUM_CH; ch++)
    {
        for (int stage = 0; stage < SELFTEST_NUM_STAGE; stage++)
        {
            const biquad_t* bq = &selftest_coeff[stage][ch];
            float32_t*      pc = &coeff_cmsis[ch][stage * 5];

            pc[0] = (float32_t)bq->b0;
            pc[1] = (float32_t)bq->b1;
            pc[2] = (float32_t)bq->b2;
#if CMSIS_NEGATE_A_COEFF
            pc[3] = (float32_t)(-bq->a1);
            pc[4] = (float32_t)(-bq->a2);
#else
            pc[3] = (float32_t)bq->a1;
            pc[4] = (float32_t)bq->a2;
#endif
        }

        arm_biquad_cascade_df2T_init_f32(&inst[ch],
                                         (uint8_t)SELFTEST_NUM_STAGE,
                                         coeff_cmsis[ch],
                                         state_cmsis[ch]);
    }

    for (int sample_idx = 0; sample_idx < SELFTEST_NUM_SAMPLE; sample_idx++)
    {
        for (int ch = 0; ch < SELFTEST_NUM_CH; ch++)
        {
            ch_in[ch][sample_idx] = in_interleaved[(sample_idx * SELFTEST_NUM_CH) + ch];
        }
    }

    for (int ch = 0; ch < SELFTEST_NUM_CH; ch++)
    {
#if 0
        arm_biquad_cascade_df2T_f32(&inst[ch],
                                    ch_in[ch],
                                    ch_out[ch],
                                    (uint32_t)SELFTEST_NUM_SAMPLE);
#else
        extern void biquad_cascade_df2T_f32_dspic33ak_opt_v1(const mchp_biquad_cascade_df2T_instance_f32 * S,
                                                             const float32_t * pSrc,
                                                             float32_t * pDst, uint32_t blockSize);
        biquad_cascade_df2T_f32_dspic33ak_opt_v1(
                                    &inst[ch],
                                    ch_in[ch],
                                    ch_out[ch],
                                    (uint32_t)SELFTEST_NUM_SAMPLE);
#endif
    }

    for (int sample_idx = 0; sample_idx < SELFTEST_NUM_SAMPLE; sample_idx++)
    {
        for (int ch = 0; ch < SELFTEST_NUM_CH; ch++)
        {
            out_interleaved[(sample_idx * SELFTEST_NUM_CH) + ch] = ch_out[ch][sample_idx];
        }
    }

    for (int i = 0; i < (SELFTEST_NUM_SAMPLE * SELFTEST_NUM_CH); i++)
    {
        const float diff = fabsf(ref_interleaved[i] - out_interleaved[i]);
        if (diff > max_abs_diff)
        {
            max_abs_diff = diff;
            max_idx = i;
        }
    }

    g_biquad_cascade_4ch_cmsis_test_max_abs_diff = max_abs_diff;

    printf("CMSIS DF2T selftest fixed: stage=%d samples=%d max_idx=%d ref=%.9f out=%.9f\n",
           SELFTEST_NUM_STAGE,
           SELFTEST_NUM_SAMPLE,
           max_idx,
           (double)ref_interleaved[max_idx],
           (double)out_interleaved[max_idx]);

    // Leave the production CMSIS path in a clean state for later audio processing.
    biquad_cascade_4ch_cmsis_init();

    return max_abs_diff;

#undef SELFTEST_NUM_STAGE
#undef SELFTEST_NUM_CH
#undef SELFTEST_NUM_SAMPLE
}
#endif //defined(ENA_SELFTEST)












// Local Function
//===========================================================

static const char* biquad_cascade_4ch_csv_skip_delim(const char* p)
{
    while ((*p == ',') || (*p == '\r') || (*p == '\n') || (*p == '\t') || (*p == ' '))
    {
        p++;
    }

    return p;
}


