sulaolab/dspic33ak-audio-dsp-sonora/src/app/apps/classic/dsp/biquad_cascade_4ch.c
static int biquad_cascade_4ch_csv_count_values(const char* text, int* parse_error_index)
{
    const char* p = text;
    char*       endp;
    int         count = 0;

    if (parse_error_index != NULL)
    {
        *parse_error_index = -1;
    }

    if (p == NULL)
    {
        if (parse_error_index != NULL)
        {
            *parse_error_index = 0;
        }
        return -1;
    }

    while (1)
    {
        p = biquad_cascade_4ch_csv_skip_delim(p);

        if (*p == '\0')
        {
            break;
        }

        (void)strtof(p, &endp);

        if (endp == p)
        {
            if (parse_error_index != NULL)
            {
                *parse_error_index = count;
            }
            return -1;
        }

        p = endp;
        count++;
    }

    return count;
}


static void biquad_cascade_4ch_csv_update_summary(void)
{
    int parse_error_index = -1;
    const int values_per_stage = (int)(BIQUAD_CASCADE_NUM_CH * 5u);
    const int expected_values  = (int)(BIQUAD_CASCADE_4CH_NUM_STAGE * BIQUAD_CASCADE_NUM_CH * 5u);
    const int total_values     = biquad_cascade_4ch_csv_count_values(g_biquad_cascade_4ch_csv_text,
                                                                      &parse_error_index);

    g_biquad_cascade_4ch_csv_expected_values = expected_values;

    if (total_values < 0)
    {
        g_biquad_cascade_4ch_csv_total_values     = -1;
        g_biquad_cascade_4ch_csv_stage_count      = -1;
        g_biquad_cascade_4ch_csv_remainder_values = -1;
        g_biquad_cascade_4ch_csv_load_result      = -2;
        g_biquad_cascade_4ch_csv_load_error_index = parse_error_index;
        return;
    }

    g_biquad_cascade_4ch_csv_total_values     = total_values;
    g_biquad_cascade_4ch_csv_stage_count      = total_values / values_per_stage;
    g_biquad_cascade_4ch_csv_remainder_values = total_values % values_per_stage;
}


static void biquad_cascade_4ch_csv_print_summary(void)
{
#if defined(ENA_CSV_REPORT_PRINTF)
    const int values_per_stage  = (int)(BIQUAD_CASCADE_NUM_CH * 5u);
    const int configured_stages = (int)BIQUAD_CASCADE_4CH_NUM_STAGE;
    const int csv_table_stages  = (int)g_biquad_cascade_4ch_csv_stage_count;
    const int total_values      = (int)g_biquad_cascade_4ch_csv_total_values;
    const int expected_values   = (int)g_biquad_cascade_4ch_csv_expected_values;
    const int extra_values      = total_values - expected_values;

    int loaded_stages  = 0;
    int ignored_stages = 0;
    int missing_stages = 0;
    int ignored_values = 0;
    int missing_values = 0;

    if ((total_values >= 0) && (g_biquad_cascade_4ch_csv_remainder_values == 0))
    {
        if (csv_table_stages >= configured_stages)
        {
            loaded_stages  = configured_stages;
            ignored_stages = csv_table_stages - configured_stages;
            ignored_values = ignored_stages * values_per_stage;
        }
        else
        {
            loaded_stages  = csv_table_stages;
            missing_stages = configured_stages - csv_table_stages;
            missing_values = missing_stages * values_per_stage;
        }
    }

    printf("\n\n");
    printf("-----------------------------------\n");
    printf("BIQUAD CSV: configured_stages=%d\n", configured_stages);
    printf("BIQUAD CSV: csv_table_stages=%d\n",  csv_table_stages);
    printf("BIQUAD CSV: loaded_stages=%d\n",     loaded_stages);
    printf("BIQUAD CSV: ignored_stages=%d\n",    ignored_stages);
    printf("BIQUAD CSV: missing_stages=%d\n",    missing_stages);
    printf("BIQUAD CSV: values_per_stage=%d\n",  values_per_stage);
    printf("BIQUAD CSV: total_values=%d\n",      total_values);
    printf("BIQUAD CSV: expected_values=%d\n",   expected_values);
    printf("BIQUAD CSV: remainder_values=%d\n",  (int)g_biquad_cascade_4ch_csv_remainder_values);
    printf("BIQUAD CSV: extra_values=%d\n",      extra_values);
    printf("BIQUAD CSV: ignored_values=%d\n",    ignored_values);
    printf("BIQUAD CSV: missing_values=%d\n",    missing_values);
    printf("BIQUAD CSV: load_result=%d\n",       (int)g_biquad_cascade_4ch_csv_load_result);
    printf("BIQUAD CSV: load_error_index=%d\n",  (int)g_biquad_cascade_4ch_csv_load_error_index);

    if (g_biquad_cascade_4ch_csv_remainder_values == 0)
    {
        printf("BIQUAD CSV: remainder check OK\n");
    }
    else
    {
        printf("BIQUAD CSV: remainder check NG\n");
    }

    if ((total_values >= 0) && (g_biquad_cascade_4ch_csv_remainder_values == 0))
    {
        if (csv_table_stages > configured_stages)
        {
            printf("BIQUAD CSV: load policy = loaded first %d stage(s), ignored remaining %d stage(s)\n",
                   configured_stages,
                   ignored_stages);
        }
        else if (csv_table_stages == configured_stages)
        {
            printf("BIQUAD CSV: load policy = loaded all %d stage(s)\n",
                   configured_stages);
        }
        else
        {
            printf("BIQUAD CSV: load policy = CSV table is short by %d stage(s)\n",
                   missing_stages);
        }
    }
    else
    {
        printf("BIQUAD CSV: load policy = not available due to parse/remainder error\n");
    }

    printf("-----------------------------------\n");
    printf("\n\n");

#else
    (void)g_biquad_cascade_4ch_csv_total_values;
    (void)g_biquad_cascade_4ch_csv_expected_values;
    (void)g_biquad_cascade_4ch_csv_stage_count;
    (void)g_biquad_cascade_4ch_csv_remainder_values;
    (void)g_biquad_cascade_4ch_csv_load_result;
    (void)g_biquad_cascade_4ch_csv_load_error_index;
#endif //defined(ENA_CSV_REPORT_PRINTF)
}


static bool biquad_cascade_4ch_csv_load_coeff_from_text(void)
{
    const char* p = g_biquad_cascade_4ch_csv_text;
    char*       endp;
    int         value_index = 0;

    g_biquad_cascade_4ch_csv_load_result      = 0;
    g_biquad_cascade_4ch_csv_load_error_index = -1;

    biquad_cascade_4ch_csv_update_summary();

    if (g_biquad_cascade_4ch_csv_total_values < 0)
    {
        biquad_cascade_4ch_csv_print_summary();
        return false;
    }

    for (uint16_t stage = 0; stage < BIQUAD_CASCADE_4CH_NUM_STAGE; stage++)
    {
        float* coeff_table[5u][BIQUAD_CASCADE_NUM_CH] =
        {
            { &g_biquad_cascade_4ch_coeff[stage][0].b0,
              &g_biquad_cascade_4ch_coeff[stage][1].b0,
              &g_biquad_cascade_4ch_coeff[stage][2].b0,
              &g_biquad_cascade_4ch_coeff[stage][3].b0 },
            { &g_biquad_cascade_4ch_coeff[stage][0].b1,
              &g_biquad_cascade_4ch_coeff[stage][1].b1,
              &g_biquad_cascade_4ch_coeff[stage][2].b1,
              &g_biquad_cascade_4ch_coeff[stage][3].b1 },
            { &g_biquad_cascade_4ch_coeff[stage][0].b2,
              &g_biquad_cascade_4ch_coeff[stage][1].b2,
              &g_biquad_cascade_4ch_coeff[stage][2].b2,
              &g_biquad_cascade_4ch_coeff[stage][3].b2 },
            { &g_biquad_cascade_4ch_coeff[stage][0].a1,
              &g_biquad_cascade_4ch_coeff[stage][1].a1,
              &g_biquad_cascade_4ch_coeff[stage][2].a1,
              &g_biquad_cascade_4ch_coeff[stage][3].a1 },
            { &g_biquad_cascade_4ch_coeff[stage][0].a2,
              &g_biquad_cascade_4ch_coeff[stage][1].a2,
              &g_biquad_cascade_4ch_coeff[stage][2].a2,
              &g_biquad_cascade_4ch_coeff[stage][3].a2 }
        };

