sulaolab/dspic33ak-audio-dsp-sonora/src/app/apps/classic/dsp/biquad_cascade_4ch.c
        for (uint8_t coeff = 0; coeff < 5u; coeff++)
        {
            for (uint8_t ch = 0; ch < BIQUAD_CASCADE_NUM_CH; ch++)
            {
                p = biquad_cascade_4ch_csv_skip_delim(p);

//                if (*p == '\0')
//                {
//                    g_biquad_cascade_4ch_csv_load_result      = -1;
//                    g_biquad_cascade_4ch_csv_load_error_index = value_index;
//                    biquad_cascade_4ch_csv_print_summary();
//                    return false;
//                }
                if (*p == '\0')
                {
                    const int values_per_stage = (int)(BIQUAD_CASCADE_NUM_CH * 5u);

                    if ((value_index > 0) && ((value_index % values_per_stage) == 0))
                    {
                        // CSV is shorter than configured stages, but it ends at a clean stage boundary.
                        // Remaining stages keep the safe bypass coefficients initialized before CSV load.
                        g_biquad_cascade_4ch_csv_load_result      = 2;
                        g_biquad_cascade_4ch_csv_load_error_index = -1;
                        biquad_cascade_4ch_csv_print_summary();
                        return true;
                    }

                    g_biquad_cascade_4ch_csv_load_result      = -1;
                    g_biquad_cascade_4ch_csv_load_error_index = value_index;
                    biquad_cascade_4ch_csv_print_summary();
                    return false;
                }

                *coeff_table[coeff][ch] = strtof(p, &endp);

                if (endp == p)
                {
                    g_biquad_cascade_4ch_csv_load_result      = -2;
                    g_biquad_cascade_4ch_csv_load_error_index = value_index;
                    biquad_cascade_4ch_csv_print_summary();
                    return false;
                }

                p = endp;
                value_index++;
            }
        }
    }

    g_biquad_cascade_4ch_csv_load_result      = 1;
    g_biquad_cascade_4ch_csv_load_error_index = -1;

    biquad_cascade_4ch_csv_print_summary();

    return true;
}










//===========================================================
// API
//===========================================================

/*static*/ biquad_cascade_4ch_t My_BiquadCascade4ch;

static volatile app_biquad_cascade_4ch_proc_state_t s_biquad_proc_state =
    APP_BIQUAD_CASCADE_4CH_PROC_NORMAL_ACTIVE;


static void biquad_cascade_4ch_process_bypass(const float* in,
                                                  float*       out,
                                                  int          samples)
{
    if( (in != NULL) && (out != NULL) && (samples > 0) )
    {
        if( in != out )
        {
            for( int i = 0; i < (samples * BIQUAD_CASCADE_NUM_CH); i++ )
            {
                out[i] = in[i];
            }
        }
    }

    s_biquad_proc_state = APP_BIQUAD_CASCADE_4CH_PROC_BYPASS_ACTIVE;
}


void app_biquad_cascade_4ch_clear_state(void)
{
    biquad_cascade_4ch_reset(&My_BiquadCascade4ch);

#if defined(USE_CMSIS_IIR_DSP_PROCESS)
    memset(g_biquad_cascade_4ch_cmsis_state,
           0x00,
           sizeof(g_biquad_cascade_4ch_cmsis_state));
#endif //defined(USE_CMSIS_IIR_DSP_PROCESS)
}


bool app_biquad_cascade_4ch_load_coeff_from_uart_csv( const float* coeff,
                                                      uint16_t     stage_num,
                                                      uint16_t     coeff_num,
                                                      uint16_t     ch_num )
{
    uint16_t stage;
    uint16_t ch;

    if (coeff == NULL)
    {
        printf("BIQUAD UART CSV: coeff is NULL\n");
        return false;
    }

    if (coeff_num != 5u)
    {
        printf("BIQUAD UART CSV: coeff_num NG: %u\n",
               (unsigned)coeff_num);
        return false;
    }

    if (ch_num != BIQUAD_CASCADE_NUM_CH)
    {
        printf("BIQUAD UART CSV: ch_num NG: %u expected=%u\n",
               (unsigned)ch_num,
               (unsigned)BIQUAD_CASCADE_NUM_CH);
        return false;
    }

    if ((stage_num == 0u) || (stage_num > BIQUAD_CASCADE_4CH_NUM_STAGE))
    {
        printf("BIQUAD UART CSV: stage_num NG: %u max=%u\n",
               (unsigned)stage_num,
               (unsigned)BIQUAD_CASCADE_4CH_NUM_STAGE);
        return false;
    }

    if (!app_biquad_cascade_4ch_is_bypass_active())
    {
        printf("BIQUAD UART CSV: rejected, Biquad process is not bypass active\n");
        return false;
    }

    // Validate all values before touching the active coefficient table.
    for (stage = 0u; stage < stage_num; stage++)
    {
        uint16_t coeff_idx;

        for (coeff_idx = 0u; coeff_idx < coeff_num; coeff_idx++)
        {
            for (ch = 0u; ch < ch_num; ch++)
            {
                const uint32_t index = (((uint32_t)stage * (uint32_t)coeff_num * (uint32_t)ch_num) +
                                        ((uint32_t)coeff_idx * (uint32_t)ch_num) +
                                        (uint32_t)ch);

                if (!isfinite(coeff[index]))
                {
                    printf("BIQUAD UART CSV: non-finite value: stage=%u coeff=%u ch=%u\n",
                           (unsigned)stage,
                           (unsigned)coeff_idx,
                           (unsigned)ch);
                    return false;
                }
            }
        }
    }

    /*
     * Runtime load policy:
     *   - Load received stages.
     *   - Remaining configured stages are set to bypass.
     *
     * This matches the existing static CSV policy where shorter CSV data can
     * leave remaining stages as safe bypass stages.
     */
    for(stage=0; stage<BIQUAD_CASCADE_4CH_NUM_STAGE; stage++ )
    {
        for(ch=0; ch<BIQUAD_CASCADE_NUM_CH; ch++ )
        {
            g_biquad_cascade_4ch_coeff[stage][ch] = biquad_bypass_1ch;
        }
    }

    for(stage=0; stage<stage_num; stage++ )
    {
        for(ch=0; ch<ch_num; ch++ )
        {
            const uint32_t base = (((uint32_t)stage * (uint32_t)coeff_num * (uint32_t)ch_num) +
                                   (uint32_t)ch);

            g_biquad_cascade_4ch_coeff[stage][ch].b0 = coeff[base + (0u * ch_num)];
            g_biquad_cascade_4ch_coeff[stage][ch].b1 = coeff[base + (1u * ch_num)];
            g_biquad_cascade_4ch_coeff[stage][ch].b2 = coeff[base + (2u * ch_num)];
            g_biquad_cascade_4ch_coeff[stage][ch].a1 = coeff[base + (3u * ch_num)];
            g_biquad_cascade_4ch_coeff[stage][ch].a2 = coeff[base + (4u * ch_num)];
        }
    }

#if defined(USE_CMSIS_IIR_DSP_PROCESS)
    // The active audio path uses CMSIS/MCHP DF2T.
    // Refresh the CMSIS coefficient layout and clear its state.
    biquad_cascade_4ch_cmsis_init();
#else
    app_biquad_cascade_4ch_clear_state();
#endif //defined(USE_CMSIS_IIR_DSP_PROCESS)

