sulaolab/dspic33ak-audio-dsp-sonora/src/app/apps/classic/dsp/biquad_cascade_4ch.c
    printf("BIQUAD UART CSV: loaded stage=%u/%u ch=%u coeff=%u\n",
           (unsigned)stage_num,
           (unsigned)BIQUAD_CASCADE_4CH_NUM_STAGE,
           (unsigned)ch_num,
           (unsigned)coeff_num);

    return true;
}

void app_biquad_cascade_4ch_init(void)
{
    biquad_cascade_4ch_init(&My_BiquadCascade4ch);
    biquad_cascade_4ch_cmsis_init();

    biquad_cascade_4ch_set_proc_active_critical();

    s_biquad_proc_state = APP_BIQUAD_CASCADE_4CH_PROC_NORMAL_ACTIVE;

#if defined(ENA_SELFTEST)
    printf("CMSIS DF2T selftest start!\n");
    float diff = biquad_cascade_4ch_cmsis_selftest();
    printf("CMSIS DF2T selftest diff = %.9f\n", diff);
    while(1)
    {
    }
#endif //defined(ENA_SELFTEST)
}


void app_biquad_cascade_4ch_request_bypass(void)
{
    if( s_biquad_proc_state == APP_BIQUAD_CASCADE_4CH_PROC_NORMAL_ACTIVE )
    {
        s_biquad_proc_state = APP_BIQUAD_CASCADE_4CH_PROC_BYPASS_REQUESTED;

        biquad_cascade_4ch_set_proc_bypass_critical();
    }
}


bool app_biquad_cascade_4ch_is_bypass_active(void)
{
    return (s_biquad_proc_state == APP_BIQUAD_CASCADE_4CH_PROC_BYPASS_ACTIVE);
}


void app_biquad_cascade_4ch_request_normal(void)
{
    biquad_cascade_4ch_set_proc_active_critical();

    s_biquad_proc_state = APP_BIQUAD_CASCADE_4CH_PROC_NORMAL_ACTIVE;
}


void app_biquad_cascade_4ch_debug_print_coeff(uint16_t stage_begin,
                                               uint16_t stage_count)
{
    uint16_t stage_end = stage_begin + stage_count;

    if (stage_begin >= BIQUAD_CASCADE_4CH_NUM_STAGE)
    {
        printf("BIQUAD COEFF DBG: stage_begin out of range: %u max=%u\n",
               (unsigned)stage_begin,
               (unsigned)BIQUAD_CASCADE_4CH_NUM_STAGE);
        return;
    }

    if (stage_end > BIQUAD_CASCADE_4CH_NUM_STAGE)
    {
        stage_end = BIQUAD_CASCADE_4CH_NUM_STAGE;
    }

    printf("\n");
    printf("BIQUAD COEFF DBG: stage %u to %u\n",
           (unsigned)stage_begin,
           (unsigned)(stage_end - 1u));
    printf("  ch0=L1, ch1=R1, ch2=L2, ch3=R2 expected\n");

    for (uint16_t stage = stage_begin; stage < stage_end; stage++)
    {
        printf("stage=%u\n", (unsigned)stage);

        for (uint8_t ch = 0; ch < BIQUAD_CASCADE_NUM_CH; ch++)
        {
            const biquad_t* bq = &g_biquad_cascade_4ch_coeff[stage][ch];

            printf("  ch%u: b0=% .9f b1=% .9f b2=% .9f a1=% .9f a2=% .9f\n",
                   (unsigned)ch,
                   (double)bq->b0,
                   (double)bq->b1,
                   (double)bq->b2,
                   (double)bq->a1,
                   (double)bq->a2);
        }
    }

    printf("\n");
}


void app_biquad_cascade_4ch_process( const float* in, float* out )
{
    biquad_cascade_proc_func_t proc;

    /*
     * Take one stable snapshot of the shared process-function pointer.
     *
     * s_biquad_proc is updated from the main/control path and read from the
     * DMA0 audio ISR path.  The update itself is protected by temporarily
     * disabling DMA0 interrupts, but copying it to a local variable makes the
     * rule explicit: this audio block calls exactly the function pointer value
     * that was observed at this point.  If the main path switches bypass/normal
     * immediately after this read, that new setting simply takes effect from a
     * following block.
     *
     * This also keeps the volatile object read in one obvious place and makes
     * the value easier to inspect in a debugger.
     */
    proc = s_biquad_proc;

    proc( in, out, APP_BLOCK_FRAMES );
}

static void app_biquad_cascade_4ch_process_wrapper(const float* in,
                                                       float*       out,
                                                       int          samples)
{
    biquad_cascade_4ch_process(&My_BiquadCascade4ch, in, out, samples);
}








// static /*const*/ biquad_t g_biquad_cascade_4ch_coeff[BIQUAD_CASCADE_4CH_NUM_STAGE][BIQUAD_CASCADE_NUM_CH] =
// {
//     // Load-test coefficient example
//     // Peaking EQ: Fs=48kHz, F0=1kHz, Q=0.707, Gain=+3dB
// 
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=1)
//     // Stage 00
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=2)
//     // Stage 01
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=3)
//     // Stage 02
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=4)
//     // Stage 03
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=5)
//     // Stage 04
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=6)
//     // Stage 05
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=7)
//     // Stage 06
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=8)
//     // Stage 07
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=9)
//     // Stage 08
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=10)
//     // Stage 09
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=11)
//     // Stage 10
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=12)
//     // Stage 11
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=13)
//     // Stage 12
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=14)
//     // Stage 13
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=15)
//     // Stage 14
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=16)
//     // Stage 15
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=17)
//     // Stage 16
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=18)
//     // Stage 17
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=19)
//     // Stage 18
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=20)
//     // Stage 19
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=21)
//     // Stage 20
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=22)
//     // Stage 21
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=23)
//     // Stage 22
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=24)
//     // Stage 23
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=25)
//     // Stage 24
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=26)
//     // Stage 25
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=27)
//     // Stage 26
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=28)
//     // Stage 27
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=29)
//     // Stage 28
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=30)
//     // Stage 29
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=31)
//     // Stage 30
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=32)
//     // Stage 31
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=33)
//     // Stage 32
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=34)
//     // Stage 33
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=35)
//     // Stage 34
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=36)
//     // Stage 35
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=37)
//     // Stage 36
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=38)
//     // Stage 37
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=39)
//     // Stage 38
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=40)
//     // Stage 39
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=41)
//     // Stage 40
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=42)
//     // Stage 41
//     {
