sulaolab/dspic33ak-audio-dsp-sonora/src/app/apps/classic/dsp/biquad_cascade_4ch.c
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=43)
//     // Stage 42
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=44)
//     // Stage 43
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=45)
//     // Stage 44
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=46)
//     // Stage 45
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=47)
//     // Stage 46
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=48)
//     // Stage 47
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=49)
//     // Stage 48
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=50)
//     // Stage 49
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=51)
//     // Stage 50
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=52)
//     // Stage 51
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=53)
//     // Stage 52
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=54)
//     // Stage 53
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=55)
//     // Stage 54
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=56)
//     // Stage 55
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=57)
//     // Stage 56
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=58)
//     // Stage 57
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=59)
//     // Stage 58
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// #if (BIQUAD_CASCADE_4CH_NUM_STAGE>=60)
//     // Stage 59
//     {
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch1 / L1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch2 / R1
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch3 / L2
//         { 1.02973215f, -1.83998013f, 0.82612509f, -1.83998013f, 0.85585724f },     // ch4 / R2
//     },
// #endif
// };

#endif //defined(ENA_BIQUAD_IIR_CASCADE)
